export const getData = () => {
  const list = [
    [
      "سید عون عباس بن ",
      "سید منذر حسین شاہ بن",
      "سید گل حسین شاہ بن ",
      "سید غلام مجتبیٰ شاہ بن ",
      "سید حسن شاہ بن ",
      "سید ستار شاہ بن",
      "سید مقیم شاہ بن",
      "سید مقبول شاہ بن",
      "سید شاہ محمد بن",
      "سید طالب شاہ بن",
      "سید اشرف علی بن ",
      "سید احمد علی بن",
      "سید عیسیٰ بن",
      "سید سما ؤالدین بن",
      "سید عباس بن ",
      "چاه لدھا بن ",
      "سید محمد آیا بن ",
      "سید یاسین بن ",
      "محمد رضا بن ",
      "سید فتاح بن",
      "سید عبد الله بن ",
      "سید جعفر بن ",
      "سید علی کتال بن",
      "سید ناصر الدین بن",
      "عبدالوهاب بن",
      "سید محمد زاہد بن ",
      "سید الله نور بن",
      "ابو سید بن",
      "سید عبدالکریم بن  ",
      "شاہ راجن کتال بن",
      "سید سلطان احمد کبیر بن",
      "سید جلال الدین سرخ بخاری بن ",
      "سید علی ا لموید بن",
      "سید جعفر بن",
      "سید محمد رضا بن",
      "سید محمود بن",
      "سید احمد بن ",
      "عبد الله بن ",
      "سید على اصفر بن",
      "سید جعفر ثانی بن",
      "سید علی نقی بن",
      "سید علی تقی بن",
      "علی  محمد رضا بن",
      "موسیٰ کاظم بن",
      "جعفر صادق بن",
      "محمد باقر بن",
      "سيد زين العابدين بن ",
      "امام حسين بن",
      "مولا علی کرم اللہ وجہہ بن",
      "ابو طالب بن",
      "عبد المطلب بن",
      "هاشم بن",
      "عبد المناف"
    ].reverse()
  ];

  // return createTree(list)[0];
  return createTree([list[0]])[0];
};

function createTree(array) {
  const tree = array.reduce((a, b) => {
    const el = a.find((x) => x.name == b[0]);
    if (el) {
      if (el.children) el.children.push(b.length > 1 ? b.slice(1) : b[0]);
      else el.children = [b.slice(1)];
    } else
      a.push(
        b.length > 1
          ? {
              name: b[0],
              children: [b.slice(1)]
            }
          : { name: b[0] }
      );
    return a;
  }, []);
  tree.forEach((t) => {
    if (t.children) t.children = createTree(t.children);
  });
  return tree;
}
